"""
dzgm国密实现库\n
`SM2`：基于椭圆曲线的数字签名算法和非对称密码\n
`SM3`：杂凑算法\n
`SM4`：流密码\n
"""

BANNER = """
 ██████╗ ███████╗██████╗ ███████╗   ██████╗ ███████╗ ██████╗ ███╗   ███╗
██╔═══██╗██╔════╝██╔══██╗╚══███╔╝   ██╔══██╗╚══███╔╝██╔════╝ ████╗ ████║
██║   ██║███████╗██║  ██║  ███╔╝    ██║  ██║  ███╔╝ ██║  ███╗██╔████╔██║
██║▄▄ ██║╚════██║██║  ██║ ███╔╝     ██║  ██║ ███╔╝  ██║   ██║██║╚██╔╝██║
╚██████╔╝███████║██████╔╝███████╗██╗██████╔╝███████╗╚██████╔╝██║ ╚═╝ ██║
 ╚══▀▀═╝ ╚══════╝╚═════╝ ╚══════╝╚═╝╚═════╝ ╚══════╝ ╚═════╝ ╚═╝     ╚═╝
                                                                        
"""

from .sm2 import SM2, point2hex, hex2point
from .sm2 import default_p, default_n, default_a, default_b, default_Gx, default_Gy, C1C2C3, C1C3C2
from .sm3 import SM3
from .sm4 import SM4
from .sm4 import PKCS7, ZERO
from .sm4 import MODE_ECB
